/* automatically generated by rust-bindgen 0.72.1 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_CXX26: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub type va_list = *mut ::std::os::raw::c_char;
unsafe extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
unsafe extern "C" {
    pub fn __security_init_cookie();
}
unsafe extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
unsafe extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
unsafe extern "C" {
    pub static mut __security_cookie: usize;
}
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_longlong;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulonglong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_int;
pub type int_fast32_t = ::std::os::raw::c_int;
pub type int_fast64_t = ::std::os::raw::c_longlong;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_uint;
pub type uint_fast32_t = ::std::os::raw::c_uint;
pub type uint_fast64_t = ::std::os::raw::c_ulonglong;
pub type intmax_t = ::std::os::raw::c_longlong;
pub type uintmax_t = ::std::os::raw::c_ulonglong;
unsafe extern "C" {
    pub fn SherpaOnnxGetVersionStr() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn SherpaOnnxGetGitSha1() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn SherpaOnnxGetGitDate() -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn SherpaOnnxFileExists(filename: *const ::std::os::raw::c_char) -> i32;
}
#[doc = " Please refer to\n https://k2-fsa.github.io/sherpa/onnx/pretrained_models/index.html\n to download pre-trained models. That is, you can find encoder-xxx.onnx\n decoder-xxx.onnx, joiner-xxx.onnx, and tokens.txt for this struct\n from there."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineTransducerModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub joiner: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlineTransducerModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOnlineTransducerModelConfig>() - 24usize];
    ["Alignment of SherpaOnnxOnlineTransducerModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOnlineTransducerModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOnlineTransducerModelConfig::encoder"]
        [::std::mem::offset_of!(SherpaOnnxOnlineTransducerModelConfig, encoder) - 0usize];
    ["Offset of field: SherpaOnnxOnlineTransducerModelConfig::decoder"]
        [::std::mem::offset_of!(SherpaOnnxOnlineTransducerModelConfig, decoder) - 8usize];
    ["Offset of field: SherpaOnnxOnlineTransducerModelConfig::joiner"]
        [::std::mem::offset_of!(SherpaOnnxOnlineTransducerModelConfig, joiner) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineParaformerModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlineParaformerModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOnlineParaformerModelConfig>() - 16usize];
    ["Alignment of SherpaOnnxOnlineParaformerModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOnlineParaformerModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOnlineParaformerModelConfig::encoder"]
        [::std::mem::offset_of!(SherpaOnnxOnlineParaformerModelConfig, encoder) - 0usize];
    ["Offset of field: SherpaOnnxOnlineParaformerModelConfig::decoder"]
        [::std::mem::offset_of!(SherpaOnnxOnlineParaformerModelConfig, decoder) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineZipformer2CtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlineZipformer2CtcModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOnlineZipformer2CtcModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOnlineZipformer2CtcModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOnlineZipformer2CtcModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOnlineZipformer2CtcModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOnlineZipformer2CtcModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineNemoCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlineNemoCtcModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOnlineNemoCtcModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOnlineNemoCtcModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOnlineNemoCtcModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOnlineNemoCtcModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOnlineNemoCtcModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineToneCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlineToneCtcModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOnlineToneCtcModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOnlineToneCtcModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOnlineToneCtcModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOnlineToneCtcModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOnlineToneCtcModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineModelConfig {
    pub transducer: SherpaOnnxOnlineTransducerModelConfig,
    pub paraformer: SherpaOnnxOnlineParaformerModelConfig,
    pub zipformer2_ctc: SherpaOnnxOnlineZipformer2CtcModelConfig,
    pub tokens: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub provider: *const ::std::os::raw::c_char,
    pub debug: i32,
    pub model_type: *const ::std::os::raw::c_char,
    pub modeling_unit: *const ::std::os::raw::c_char,
    pub bpe_vocab: *const ::std::os::raw::c_char,
    #[doc = " if non-null, loading the tokens from the buffer instead of from the\n \"tokens\" file"]
    pub tokens_buf: *const ::std::os::raw::c_char,
    #[doc = " byte size excluding the trailing '\\0'"]
    pub tokens_buf_size: i32,
    pub nemo_ctc: SherpaOnnxOnlineNemoCtcModelConfig,
    pub t_one_ctc: SherpaOnnxOnlineToneCtcModelConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlineModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOnlineModelConfig>() - 136usize];
    ["Alignment of SherpaOnnxOnlineModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOnlineModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::transducer"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, transducer) - 0usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::paraformer"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, paraformer) - 24usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::zipformer2_ctc"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, zipformer2_ctc) - 40usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::tokens"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, tokens) - 48usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::num_threads"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, num_threads) - 56usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::provider"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, provider) - 64usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, debug) - 72usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::model_type"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, model_type) - 80usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::modeling_unit"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, modeling_unit) - 88usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::bpe_vocab"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, bpe_vocab) - 96usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::tokens_buf"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, tokens_buf) - 104usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::tokens_buf_size"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, tokens_buf_size) - 112usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::nemo_ctc"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, nemo_ctc) - 120usize];
    ["Offset of field: SherpaOnnxOnlineModelConfig::t_one_ctc"]
        [::std::mem::offset_of!(SherpaOnnxOnlineModelConfig, t_one_ctc) - 128usize];
};
#[doc = " It expects 16 kHz 16-bit single channel wave format."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxFeatureConfig {
    #[doc = " Sample rate of the input data. MUST match the one expected\n by the model. For instance, it should be 16000 for models provided\n by us."]
    pub sample_rate: i32,
    #[doc = " Feature dimension of the model.\n For instance, it should be 80 for models provided by us."]
    pub feature_dim: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxFeatureConfig"][::std::mem::size_of::<SherpaOnnxFeatureConfig>() - 8usize];
    ["Alignment of SherpaOnnxFeatureConfig"]
        [::std::mem::align_of::<SherpaOnnxFeatureConfig>() - 4usize];
    ["Offset of field: SherpaOnnxFeatureConfig::sample_rate"]
        [::std::mem::offset_of!(SherpaOnnxFeatureConfig, sample_rate) - 0usize];
    ["Offset of field: SherpaOnnxFeatureConfig::feature_dim"]
        [::std::mem::offset_of!(SherpaOnnxFeatureConfig, feature_dim) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineCtcFstDecoderConfig {
    pub graph: *const ::std::os::raw::c_char,
    pub max_active: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlineCtcFstDecoderConfig"]
        [::std::mem::size_of::<SherpaOnnxOnlineCtcFstDecoderConfig>() - 16usize];
    ["Alignment of SherpaOnnxOnlineCtcFstDecoderConfig"]
        [::std::mem::align_of::<SherpaOnnxOnlineCtcFstDecoderConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOnlineCtcFstDecoderConfig::graph"]
        [::std::mem::offset_of!(SherpaOnnxOnlineCtcFstDecoderConfig, graph) - 0usize];
    ["Offset of field: SherpaOnnxOnlineCtcFstDecoderConfig::max_active"]
        [::std::mem::offset_of!(SherpaOnnxOnlineCtcFstDecoderConfig, max_active) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxHomophoneReplacerConfig {
    pub dict_dir: *const ::std::os::raw::c_char,
    pub lexicon: *const ::std::os::raw::c_char,
    pub rule_fsts: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxHomophoneReplacerConfig"]
        [::std::mem::size_of::<SherpaOnnxHomophoneReplacerConfig>() - 24usize];
    ["Alignment of SherpaOnnxHomophoneReplacerConfig"]
        [::std::mem::align_of::<SherpaOnnxHomophoneReplacerConfig>() - 8usize];
    ["Offset of field: SherpaOnnxHomophoneReplacerConfig::dict_dir"]
        [::std::mem::offset_of!(SherpaOnnxHomophoneReplacerConfig, dict_dir) - 0usize];
    ["Offset of field: SherpaOnnxHomophoneReplacerConfig::lexicon"]
        [::std::mem::offset_of!(SherpaOnnxHomophoneReplacerConfig, lexicon) - 8usize];
    ["Offset of field: SherpaOnnxHomophoneReplacerConfig::rule_fsts"]
        [::std::mem::offset_of!(SherpaOnnxHomophoneReplacerConfig, rule_fsts) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineRecognizerConfig {
    pub feat_config: SherpaOnnxFeatureConfig,
    pub model_config: SherpaOnnxOnlineModelConfig,
    #[doc = " Possible values are: greedy_search, modified_beam_search"]
    pub decoding_method: *const ::std::os::raw::c_char,
    #[doc = " Used only when decoding_method is modified_beam_search\n Example value: 4"]
    pub max_active_paths: i32,
    #[doc = " 0 to disable endpoint detection.\n A non-zero value to enable endpoint detection."]
    pub enable_endpoint: i32,
    #[doc = " An endpoint is detected if trailing silence in seconds is larger than\n this value even if nothing has been decoded.\n Used only when enable_endpoint is not 0."]
    pub rule1_min_trailing_silence: f32,
    #[doc = " An endpoint is detected if trailing silence in seconds is larger than\n this value after something that is not blank has been decoded.\n Used only when enable_endpoint is not 0."]
    pub rule2_min_trailing_silence: f32,
    #[doc = " An endpoint is detected if the utterance in seconds is larger than\n this value.\n Used only when enable_endpoint is not 0."]
    pub rule3_min_utterance_length: f32,
    #[doc = " Path to the hotwords."]
    pub hotwords_file: *const ::std::os::raw::c_char,
    #[doc = " Bonus score for each token in hotwords."]
    pub hotwords_score: f32,
    pub ctc_fst_decoder_config: SherpaOnnxOnlineCtcFstDecoderConfig,
    pub rule_fsts: *const ::std::os::raw::c_char,
    pub rule_fars: *const ::std::os::raw::c_char,
    pub blank_penalty: f32,
    #[doc = " if non-nullptr, loading the hotwords from the buffered string directly in"]
    pub hotwords_buf: *const ::std::os::raw::c_char,
    #[doc = " byte size excluding the tailing '\\0'"]
    pub hotwords_buf_size: i32,
    pub hr: SherpaOnnxHomophoneReplacerConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlineRecognizerConfig"]
        [::std::mem::size_of::<SherpaOnnxOnlineRecognizerConfig>() - 272usize];
    ["Alignment of SherpaOnnxOnlineRecognizerConfig"]
        [::std::mem::align_of::<SherpaOnnxOnlineRecognizerConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::feat_config"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, feat_config) - 0usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::model_config"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, model_config) - 8usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::decoding_method"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, decoding_method) - 144usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::max_active_paths"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, max_active_paths) - 152usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::enable_endpoint"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, enable_endpoint) - 156usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::rule1_min_trailing_silence"][::std::mem::offset_of!(
        SherpaOnnxOnlineRecognizerConfig,
        rule1_min_trailing_silence
    ) - 160usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::rule2_min_trailing_silence"][::std::mem::offset_of!(
        SherpaOnnxOnlineRecognizerConfig,
        rule2_min_trailing_silence
    ) - 164usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::rule3_min_utterance_length"][::std::mem::offset_of!(
        SherpaOnnxOnlineRecognizerConfig,
        rule3_min_utterance_length
    ) - 168usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::hotwords_file"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, hotwords_file) - 176usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::hotwords_score"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, hotwords_score) - 184usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::ctc_fst_decoder_config"][::std::mem::offset_of!(
        SherpaOnnxOnlineRecognizerConfig,
        ctc_fst_decoder_config
    ) - 192usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::rule_fsts"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, rule_fsts) - 208usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::rule_fars"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, rule_fars) - 216usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::blank_penalty"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, blank_penalty) - 224usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::hotwords_buf"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, hotwords_buf) - 232usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::hotwords_buf_size"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, hotwords_buf_size) - 240usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerConfig::hr"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerConfig, hr) - 248usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineRecognizerResult {
    pub text: *const ::std::os::raw::c_char,
    pub tokens: *const ::std::os::raw::c_char,
    pub tokens_arr: *const *const ::std::os::raw::c_char,
    pub timestamps: *mut f32,
    pub count: i32,
    #[doc = " Return a json string.\n\n The returned string contains:\n   {\n     \"text\": \"The recognition result\",\n     \"tokens\": [x, x, x],\n     \"timestamps\": [x, x, x],\n     \"segment\": x,\n     \"start_time\": x,\n     \"is_final\": true|false\n   }"]
    pub json: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlineRecognizerResult"]
        [::std::mem::size_of::<SherpaOnnxOnlineRecognizerResult>() - 48usize];
    ["Alignment of SherpaOnnxOnlineRecognizerResult"]
        [::std::mem::align_of::<SherpaOnnxOnlineRecognizerResult>() - 8usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerResult::text"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerResult, text) - 0usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerResult::tokens"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerResult, tokens) - 8usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerResult::tokens_arr"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerResult, tokens_arr) - 16usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerResult::timestamps"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerResult, timestamps) - 24usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerResult::count"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerResult, count) - 32usize];
    ["Offset of field: SherpaOnnxOnlineRecognizerResult::json"]
        [::std::mem::offset_of!(SherpaOnnxOnlineRecognizerResult, json) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineRecognizer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlineStream {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = " @param config  Config for the recognizer.\n @return Return a pointer to the recognizer. The user has to invoke"]
    pub fn SherpaOnnxCreateOnlineRecognizer(
        config: *const SherpaOnnxOnlineRecognizerConfig,
    ) -> *const SherpaOnnxOnlineRecognizer;
}
unsafe extern "C" {
    #[doc = " Free a pointer returned by SherpaOnnxCreateOnlineRecognizer()\n\n @param p A pointer returned by SherpaOnnxCreateOnlineRecognizer()"]
    pub fn SherpaOnnxDestroyOnlineRecognizer(recognizer: *const SherpaOnnxOnlineRecognizer);
}
unsafe extern "C" {
    #[doc = " Create an online stream for accepting wave samples.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOnlineRecognizer()\n @return Return a pointer to an OnlineStream. The user has to invoke\n         SherpaOnnxDestroyOnlineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateOnlineStream(
        recognizer: *const SherpaOnnxOnlineRecognizer,
    ) -> *const SherpaOnnxOnlineStream;
}
unsafe extern "C" {
    #[doc = " Create an online stream for accepting wave samples with the specified hot\n words.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOnlineRecognizer()\n @return Return a pointer to an OnlineStream. The user has to invoke\n         SherpaOnnxDestroyOnlineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateOnlineStreamWithHotwords(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        hotwords: *const ::std::os::raw::c_char,
    ) -> *const SherpaOnnxOnlineStream;
}
unsafe extern "C" {
    #[doc = " Destroy an online stream.\n\n @param stream A pointer returned by SherpaOnnxCreateOnlineStream()"]
    pub fn SherpaOnnxDestroyOnlineStream(stream: *const SherpaOnnxOnlineStream);
}
unsafe extern "C" {
    #[doc = " Accept input audio samples and compute the features.\n The user has to invoke SherpaOnnxDecodeOnlineStream() to run the neural\n network and decoding.\n\n @param stream  A pointer returned by SherpaOnnxCreateOnlineStream().\n @param sample_rate  Sample rate of the input samples. If it is different\n                     from config.feat_config.sample_rate, we will do\n                     resampling inside sherpa-onnx.\n @param samples A pointer to a 1-D array containing audio samples.\n                The range of samples has to be normalized to [-1, 1].\n @param n  Number of elements in the samples array."]
    pub fn SherpaOnnxOnlineStreamAcceptWaveform(
        stream: *const SherpaOnnxOnlineStream,
        sample_rate: i32,
        samples: *const f32,
        n: i32,
    );
}
unsafe extern "C" {
    #[doc = " Return 1 if there are enough number of feature frames for decoding.\n Return 0 otherwise.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOnlineRecognizer\n @param stream  A pointer returned by SherpaOnnxCreateOnlineStream"]
    pub fn SherpaOnnxIsOnlineStreamReady(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " Precondition for this function: SherpaOnnxIsOnlineStreamReady() MUST\n return 1.\n\n Usage example:\n\n  while (SherpaOnnxIsOnlineStreamReady(recognizer, stream)) {\n     SherpaOnnxDecodeOnlineStream(recognizer, stream);\n  }\n"]
    pub fn SherpaOnnxDecodeOnlineStream(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    );
}
unsafe extern "C" {
    #[doc = " This function is similar to SherpaOnnxDecodeOnlineStream(). It decodes\n multiple OnlineStream in parallel.\n\n Caution: The caller has to ensure each OnlineStream is ready, i.e.,\n SherpaOnnxIsOnlineStreamReady() for that stream should return 1.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOnlineRecognizer()\n @param streams  A pointer array containing pointers returned by\n                 SherpaOnnxCreateOnlineRecognizer()\n @param n  Number of elements in the given streams array."]
    pub fn SherpaOnnxDecodeMultipleOnlineStreams(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        streams: *mut *const SherpaOnnxOnlineStream,
        n: i32,
    );
}
unsafe extern "C" {
    #[doc = " Get the decoding results so far for an OnlineStream.\n\n @param recognizer A pointer returned by SherpaOnnxCreateOnlineRecognizer().\n @param stream A pointer returned by SherpaOnnxCreateOnlineStream().\n @return A pointer containing the result. The user has to invoke\n         SherpaOnnxDestroyOnlineRecognizerResult() to free the returned\n         pointer to avoid memory leak."]
    pub fn SherpaOnnxGetOnlineStreamResult(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    ) -> *const SherpaOnnxOnlineRecognizerResult;
}
unsafe extern "C" {
    #[doc = " Destroy the pointer returned by SherpaOnnxGetOnlineStreamResult().\n\n @param r A pointer returned by SherpaOnnxGetOnlineStreamResult()"]
    pub fn SherpaOnnxDestroyOnlineRecognizerResult(r: *const SherpaOnnxOnlineRecognizerResult);
}
unsafe extern "C" {
    #[doc = " Return the result as a json string.\n The user has to invoke\n SherpaOnnxDestroyOnlineStreamResultJson()\n to free the returned pointer to avoid memory leak"]
    pub fn SherpaOnnxGetOnlineStreamResultAsJson(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyOnlineStreamResultJson(s: *const ::std::os::raw::c_char);
}
unsafe extern "C" {
    #[doc = " SherpaOnnxOnlineStreamReset an OnlineStream , which clears the neural\n network model state and the state for decoding.\n\n @param recognizer A pointer returned by SherpaOnnxCreateOnlineRecognizer().\n @param stream A pointer returned by SherpaOnnxCreateOnlineStream"]
    pub fn SherpaOnnxOnlineStreamReset(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    );
}
unsafe extern "C" {
    #[doc = " Signal that no more audio samples would be available.\n After this call, you cannot call SherpaOnnxOnlineStreamAcceptWaveform() any\n more.\n\n @param stream A pointer returned by SherpaOnnxCreateOnlineStream()"]
    pub fn SherpaOnnxOnlineStreamInputFinished(stream: *const SherpaOnnxOnlineStream);
}
unsafe extern "C" {
    #[doc = " Return 1 if an endpoint has been detected.\n\n @param recognizer A pointer returned by SherpaOnnxCreateOnlineRecognizer()\n @param stream A pointer returned by SherpaOnnxCreateOnlineStream()\n @return Return 1 if an endpoint is detected. Return 0 otherwise."]
    pub fn SherpaOnnxOnlineStreamIsEndpoint(
        recognizer: *const SherpaOnnxOnlineRecognizer,
        stream: *const SherpaOnnxOnlineStream,
    ) -> i32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxDisplay {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = " Create a display object. Must be freed using SherpaOnnxDestroyDisplay to\n avoid memory leak."]
    pub fn SherpaOnnxCreateDisplay(max_word_per_line: i32) -> *const SherpaOnnxDisplay;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyDisplay(display: *const SherpaOnnxDisplay);
}
unsafe extern "C" {
    #[doc = " Print the result."]
    pub fn SherpaOnnxPrint(
        display: *const SherpaOnnxDisplay,
        idx: i32,
        s: *const ::std::os::raw::c_char,
    );
}
#[doc = " Please refer to\n https://k2-fsa.github.io/sherpa/onnx/pretrained_models/index.html\n to download pre-trained models. That is, you can find encoder-xxx.onnx\n decoder-xxx.onnx, and joiner-xxx.onnx for this struct\n from there."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTransducerModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub joiner: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineTransducerModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineTransducerModelConfig>() - 24usize];
    ["Alignment of SherpaOnnxOfflineTransducerModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineTransducerModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineTransducerModelConfig::encoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTransducerModelConfig, encoder) - 0usize];
    ["Offset of field: SherpaOnnxOfflineTransducerModelConfig::decoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTransducerModelConfig, decoder) - 8usize];
    ["Offset of field: SherpaOnnxOfflineTransducerModelConfig::joiner"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTransducerModelConfig, joiner) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineParaformerModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineParaformerModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineParaformerModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOfflineParaformerModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineParaformerModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineParaformerModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineParaformerModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineNemoEncDecCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineNemoEncDecCtcModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineNemoEncDecCtcModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOfflineNemoEncDecCtcModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineNemoEncDecCtcModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineNemoEncDecCtcModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineNemoEncDecCtcModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineWhisperModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub language: *const ::std::os::raw::c_char,
    pub task: *const ::std::os::raw::c_char,
    pub tail_paddings: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineWhisperModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineWhisperModelConfig>() - 40usize];
    ["Alignment of SherpaOnnxOfflineWhisperModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineWhisperModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineWhisperModelConfig::encoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineWhisperModelConfig, encoder) - 0usize];
    ["Offset of field: SherpaOnnxOfflineWhisperModelConfig::decoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineWhisperModelConfig, decoder) - 8usize];
    ["Offset of field: SherpaOnnxOfflineWhisperModelConfig::language"]
        [::std::mem::offset_of!(SherpaOnnxOfflineWhisperModelConfig, language) - 16usize];
    ["Offset of field: SherpaOnnxOfflineWhisperModelConfig::task"]
        [::std::mem::offset_of!(SherpaOnnxOfflineWhisperModelConfig, task) - 24usize];
    ["Offset of field: SherpaOnnxOfflineWhisperModelConfig::tail_paddings"]
        [::std::mem::offset_of!(SherpaOnnxOfflineWhisperModelConfig, tail_paddings) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineCanaryModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub src_lang: *const ::std::os::raw::c_char,
    pub tgt_lang: *const ::std::os::raw::c_char,
    pub use_pnc: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineCanaryModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineCanaryModelConfig>() - 40usize];
    ["Alignment of SherpaOnnxOfflineCanaryModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineCanaryModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineCanaryModelConfig::encoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineCanaryModelConfig, encoder) - 0usize];
    ["Offset of field: SherpaOnnxOfflineCanaryModelConfig::decoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineCanaryModelConfig, decoder) - 8usize];
    ["Offset of field: SherpaOnnxOfflineCanaryModelConfig::src_lang"]
        [::std::mem::offset_of!(SherpaOnnxOfflineCanaryModelConfig, src_lang) - 16usize];
    ["Offset of field: SherpaOnnxOfflineCanaryModelConfig::tgt_lang"]
        [::std::mem::offset_of!(SherpaOnnxOfflineCanaryModelConfig, tgt_lang) - 24usize];
    ["Offset of field: SherpaOnnxOfflineCanaryModelConfig::use_pnc"]
        [::std::mem::offset_of!(SherpaOnnxOfflineCanaryModelConfig, use_pnc) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineFireRedAsrModelConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineFireRedAsrModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineFireRedAsrModelConfig>() - 16usize];
    ["Alignment of SherpaOnnxOfflineFireRedAsrModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineFireRedAsrModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineFireRedAsrModelConfig::encoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineFireRedAsrModelConfig, encoder) - 0usize];
    ["Offset of field: SherpaOnnxOfflineFireRedAsrModelConfig::decoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineFireRedAsrModelConfig, decoder) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineMoonshineModelConfig {
    pub preprocessor: *const ::std::os::raw::c_char,
    pub encoder: *const ::std::os::raw::c_char,
    pub uncached_decoder: *const ::std::os::raw::c_char,
    pub cached_decoder: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineMoonshineModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineMoonshineModelConfig>() - 32usize];
    ["Alignment of SherpaOnnxOfflineMoonshineModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineMoonshineModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineMoonshineModelConfig::preprocessor"]
        [::std::mem::offset_of!(SherpaOnnxOfflineMoonshineModelConfig, preprocessor) - 0usize];
    ["Offset of field: SherpaOnnxOfflineMoonshineModelConfig::encoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineMoonshineModelConfig, encoder) - 8usize];
    ["Offset of field: SherpaOnnxOfflineMoonshineModelConfig::uncached_decoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineMoonshineModelConfig, uncached_decoder) - 16usize];
    ["Offset of field: SherpaOnnxOfflineMoonshineModelConfig::cached_decoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineMoonshineModelConfig, cached_decoder) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTdnnModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineTdnnModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineTdnnModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOfflineTdnnModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineTdnnModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineTdnnModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTdnnModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineLMConfig {
    pub model: *const ::std::os::raw::c_char,
    pub scale: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineLMConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineLMConfig>() - 16usize];
    ["Alignment of SherpaOnnxOfflineLMConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineLMConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineLMConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineLMConfig, model) - 0usize];
    ["Offset of field: SherpaOnnxOfflineLMConfig::scale"]
        [::std::mem::offset_of!(SherpaOnnxOfflineLMConfig, scale) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSenseVoiceModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub language: *const ::std::os::raw::c_char,
    pub use_itn: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineSenseVoiceModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineSenseVoiceModelConfig>() - 24usize];
    ["Alignment of SherpaOnnxOfflineSenseVoiceModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineSenseVoiceModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineSenseVoiceModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSenseVoiceModelConfig, model) - 0usize];
    ["Offset of field: SherpaOnnxOfflineSenseVoiceModelConfig::language"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSenseVoiceModelConfig, language) - 8usize];
    ["Offset of field: SherpaOnnxOfflineSenseVoiceModelConfig::use_itn"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSenseVoiceModelConfig, use_itn) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineDolphinModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineDolphinModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineDolphinModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOfflineDolphinModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineDolphinModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineDolphinModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineDolphinModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineZipformerCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineZipformerCtcModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineZipformerCtcModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOfflineZipformerCtcModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineZipformerCtcModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineZipformerCtcModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineZipformerCtcModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineWenetCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineWenetCtcModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineWenetCtcModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOfflineWenetCtcModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineWenetCtcModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineWenetCtcModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineWenetCtcModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineOmnilingualAsrCtcModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineOmnilingualAsrCtcModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineOmnilingualAsrCtcModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOfflineOmnilingualAsrCtcModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineOmnilingualAsrCtcModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineOmnilingualAsrCtcModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineOmnilingualAsrCtcModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineModelConfig {
    pub transducer: SherpaOnnxOfflineTransducerModelConfig,
    pub paraformer: SherpaOnnxOfflineParaformerModelConfig,
    pub nemo_ctc: SherpaOnnxOfflineNemoEncDecCtcModelConfig,
    pub whisper: SherpaOnnxOfflineWhisperModelConfig,
    pub tdnn: SherpaOnnxOfflineTdnnModelConfig,
    pub tokens: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
    pub model_type: *const ::std::os::raw::c_char,
    pub modeling_unit: *const ::std::os::raw::c_char,
    pub bpe_vocab: *const ::std::os::raw::c_char,
    pub telespeech_ctc: *const ::std::os::raw::c_char,
    pub sense_voice: SherpaOnnxOfflineSenseVoiceModelConfig,
    pub moonshine: SherpaOnnxOfflineMoonshineModelConfig,
    pub fire_red_asr: SherpaOnnxOfflineFireRedAsrModelConfig,
    pub dolphin: SherpaOnnxOfflineDolphinModelConfig,
    pub zipformer_ctc: SherpaOnnxOfflineZipformerCtcModelConfig,
    pub canary: SherpaOnnxOfflineCanaryModelConfig,
    pub wenet_ctc: SherpaOnnxOfflineWenetCtcModelConfig,
    pub omnilingual: SherpaOnnxOfflineOmnilingualAsrCtcModelConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineModelConfig>() - 288usize];
    ["Alignment of SherpaOnnxOfflineModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::transducer"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, transducer) - 0usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::paraformer"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, paraformer) - 24usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::nemo_ctc"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, nemo_ctc) - 32usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::whisper"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, whisper) - 40usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::tdnn"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, tdnn) - 80usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::tokens"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, tokens) - 88usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::num_threads"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, num_threads) - 96usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, debug) - 100usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::provider"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, provider) - 104usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::model_type"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, model_type) - 112usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::modeling_unit"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, modeling_unit) - 120usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::bpe_vocab"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, bpe_vocab) - 128usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::telespeech_ctc"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, telespeech_ctc) - 136usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::sense_voice"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, sense_voice) - 144usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::moonshine"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, moonshine) - 168usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::fire_red_asr"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, fire_red_asr) - 200usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::dolphin"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, dolphin) - 216usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::zipformer_ctc"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, zipformer_ctc) - 224usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::canary"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, canary) - 232usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::wenet_ctc"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, wenet_ctc) - 272usize];
    ["Offset of field: SherpaOnnxOfflineModelConfig::omnilingual"]
        [::std::mem::offset_of!(SherpaOnnxOfflineModelConfig, omnilingual) - 280usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineRecognizerConfig {
    pub feat_config: SherpaOnnxFeatureConfig,
    pub model_config: SherpaOnnxOfflineModelConfig,
    pub lm_config: SherpaOnnxOfflineLMConfig,
    pub decoding_method: *const ::std::os::raw::c_char,
    pub max_active_paths: i32,
    #[doc = " Path to the hotwords."]
    pub hotwords_file: *const ::std::os::raw::c_char,
    #[doc = " Bonus score for each token in hotwords."]
    pub hotwords_score: f32,
    pub rule_fsts: *const ::std::os::raw::c_char,
    pub rule_fars: *const ::std::os::raw::c_char,
    pub blank_penalty: f32,
    pub hr: SherpaOnnxHomophoneReplacerConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineRecognizerConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineRecognizerConfig>() - 392usize];
    ["Alignment of SherpaOnnxOfflineRecognizerConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineRecognizerConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::feat_config"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, feat_config) - 0usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::model_config"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, model_config) - 8usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::lm_config"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, lm_config) - 296usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::decoding_method"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, decoding_method) - 312usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::max_active_paths"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, max_active_paths) - 320usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::hotwords_file"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, hotwords_file) - 328usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::hotwords_score"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, hotwords_score) - 336usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::rule_fsts"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, rule_fsts) - 344usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::rule_fars"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, rule_fars) - 352usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::blank_penalty"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, blank_penalty) - 360usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerConfig::hr"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerConfig, hr) - 368usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineRecognizer {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineStream {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = " @param config  Config for the recognizer.\n @return Return a pointer to the recognizer. The user has to invoke"]
    pub fn SherpaOnnxCreateOfflineRecognizer(
        config: *const SherpaOnnxOfflineRecognizerConfig,
    ) -> *const SherpaOnnxOfflineRecognizer;
}
unsafe extern "C" {
    #[doc = " @param config  Config for the recognizer."]
    pub fn SherpaOnnxOfflineRecognizerSetConfig(
        recognizer: *const SherpaOnnxOfflineRecognizer,
        config: *const SherpaOnnxOfflineRecognizerConfig,
    );
}
unsafe extern "C" {
    #[doc = " Free a pointer returned by SherpaOnnxCreateOfflineRecognizer()\n\n @param p A pointer returned by SherpaOnnxCreateOfflineRecognizer()"]
    pub fn SherpaOnnxDestroyOfflineRecognizer(recognizer: *const SherpaOnnxOfflineRecognizer);
}
unsafe extern "C" {
    #[doc = " Create an offline stream for accepting wave samples.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOfflineRecognizer()\n @return Return a pointer to an OfflineStream. The user has to invoke\n         SherpaOnnxDestroyOfflineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateOfflineStream(
        recognizer: *const SherpaOnnxOfflineRecognizer,
    ) -> *const SherpaOnnxOfflineStream;
}
unsafe extern "C" {
    #[doc = " Create an offline stream for accepting wave samples with the specified hot\n words.\n\n @param recognizer  A pointer returned by SherpaOnnxCreateOfflineRecognizer()\n @return Return a pointer to an OfflineStream. The user has to invoke\n         SherpaOnnxDestroyOfflineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateOfflineStreamWithHotwords(
        recognizer: *const SherpaOnnxOfflineRecognizer,
        hotwords: *const ::std::os::raw::c_char,
    ) -> *const SherpaOnnxOfflineStream;
}
unsafe extern "C" {
    #[doc = " Destroy an offline stream.\n\n @param stream A pointer returned by SherpaOnnxCreateOfflineStream()"]
    pub fn SherpaOnnxDestroyOfflineStream(stream: *const SherpaOnnxOfflineStream);
}
unsafe extern "C" {
    #[doc = " Accept input audio samples and compute the features.\n The user has to invoke SherpaOnnxDecodeOfflineStream() to run the neural\n network and decoding.\n\n @param stream  A pointer returned by SherpaOnnxCreateOfflineStream().\n @param sample_rate  Sample rate of the input samples. If it is different\n                     from config.feat_config.sample_rate, we will do\n                     resampling inside sherpa-onnx.\n @param samples A pointer to a 1-D array containing audio samples.\n                The range of samples has to be normalized to [-1, 1].\n @param n  Number of elements in the samples array.\n\n @caution: For each offline stream, please invoke this function only once!"]
    pub fn SherpaOnnxAcceptWaveformOffline(
        stream: *const SherpaOnnxOfflineStream,
        sample_rate: i32,
        samples: *const f32,
        n: i32,
    );
}
unsafe extern "C" {
    #[doc = " Decode an offline stream.\n\n We assume you have invoked SherpaOnnxAcceptWaveformOffline() for the given\n stream before calling this function.\n\n @param recognizer A pointer returned by SherpaOnnxCreateOfflineRecognizer().\n @param stream A pointer returned by SherpaOnnxCreateOfflineStream()"]
    pub fn SherpaOnnxDecodeOfflineStream(
        recognizer: *const SherpaOnnxOfflineRecognizer,
        stream: *const SherpaOnnxOfflineStream,
    );
}
unsafe extern "C" {
    #[doc = " Decode a list offline streams in parallel.\n\n We assume you have invoked SherpaOnnxAcceptWaveformOffline() for each stream\n before calling this function.\n\n @param recognizer A pointer returned by SherpaOnnxCreateOfflineRecognizer().\n @param streams A pointer pointer array containing pointers returned\n                by SherpaOnnxCreateOfflineStream().\n @param n Number of entries in the given streams."]
    pub fn SherpaOnnxDecodeMultipleOfflineStreams(
        recognizer: *const SherpaOnnxOfflineRecognizer,
        streams: *mut *const SherpaOnnxOfflineStream,
        n: i32,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineRecognizerResult {
    pub text: *const ::std::os::raw::c_char,
    pub timestamps: *mut f32,
    pub count: i32,
    pub tokens: *const ::std::os::raw::c_char,
    pub tokens_arr: *const *const ::std::os::raw::c_char,
    #[doc = " Return a json string.\n\n The returned string contains:\n   {\n     \"text\": \"The recognition result\",\n     \"tokens\": [x, x, x],\n     \"timestamps\": [x, x, x],\n     \"durations\": [x, x, x],\n     \"segment\": x,\n     \"start_time\": x,\n     \"is_final\": true|false\n   }"]
    pub json: *const ::std::os::raw::c_char,
    pub lang: *const ::std::os::raw::c_char,
    pub emotion: *const ::std::os::raw::c_char,
    pub event: *const ::std::os::raw::c_char,
    pub durations: *mut f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineRecognizerResult"]
        [::std::mem::size_of::<SherpaOnnxOfflineRecognizerResult>() - 80usize];
    ["Alignment of SherpaOnnxOfflineRecognizerResult"]
        [::std::mem::align_of::<SherpaOnnxOfflineRecognizerResult>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerResult::text"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerResult, text) - 0usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerResult::timestamps"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerResult, timestamps) - 8usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerResult::count"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerResult, count) - 16usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerResult::tokens"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerResult, tokens) - 24usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerResult::tokens_arr"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerResult, tokens_arr) - 32usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerResult::json"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerResult, json) - 40usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerResult::lang"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerResult, lang) - 48usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerResult::emotion"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerResult, emotion) - 56usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerResult::event"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerResult, event) - 64usize];
    ["Offset of field: SherpaOnnxOfflineRecognizerResult::durations"]
        [::std::mem::offset_of!(SherpaOnnxOfflineRecognizerResult, durations) - 72usize];
};
unsafe extern "C" {
    #[doc = " Get the result of the offline stream.\n\n We assume you have called SherpaOnnxDecodeOfflineStream() or\n SherpaOnnxDecodeMultipleOfflineStreams() with the given stream before\n calling this function.\n\n @param stream A pointer returned by SherpaOnnxCreateOfflineStream().\n @return Return a pointer to the result. The user has to invoke\n         SherpaOnnxDestroyOnlineRecognizerResult() to free the returned\n         pointer to avoid memory leak."]
    pub fn SherpaOnnxGetOfflineStreamResult(
        stream: *const SherpaOnnxOfflineStream,
    ) -> *const SherpaOnnxOfflineRecognizerResult;
}
unsafe extern "C" {
    #[doc = " Destroy the pointer returned by SherpaOnnxGetOfflineStreamResult().\n\n @param r A pointer returned by SherpaOnnxGetOfflineStreamResult()"]
    pub fn SherpaOnnxDestroyOfflineRecognizerResult(r: *const SherpaOnnxOfflineRecognizerResult);
}
unsafe extern "C" {
    #[doc = " Return the result as a json string.\n The user has to use SherpaOnnxDestroyOfflineStreamResultJson()\n to free the returned pointer to avoid memory leak"]
    pub fn SherpaOnnxGetOfflineStreamResultAsJson(
        stream: *const SherpaOnnxOfflineStream,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyOfflineStreamResultJson(s: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxKeywordResult {
    #[doc = " The triggered keyword.\n For English, it consists of space separated words.\n For Chinese, it consists of Chinese words without spaces.\n Example 1: \"hello world\"\n Example 2: \"\""]
    pub keyword: *const ::std::os::raw::c_char,
    #[doc = " Decoded results at the token level.\n For instance, for BPE-based models it consists of a list of BPE tokens."]
    pub tokens: *const ::std::os::raw::c_char,
    pub tokens_arr: *const *const ::std::os::raw::c_char,
    pub count: i32,
    #[doc = " timestamps.size() == tokens.size()\n timestamps[i] records the time in seconds when tokens[i] is decoded."]
    pub timestamps: *mut f32,
    #[doc = " Starting time of this segment.\n When an endpoint is detected, it will change"]
    pub start_time: f32,
    #[doc = " Return a json string.\n\n The returned string contains:\n   {\n     \"keyword\": \"The triggered keyword\",\n     \"tokens\": [x, x, x],\n     \"timestamps\": [x, x, x],\n     \"start_time\": x,\n   }"]
    pub json: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxKeywordResult"][::std::mem::size_of::<SherpaOnnxKeywordResult>() - 56usize];
    ["Alignment of SherpaOnnxKeywordResult"]
        [::std::mem::align_of::<SherpaOnnxKeywordResult>() - 8usize];
    ["Offset of field: SherpaOnnxKeywordResult::keyword"]
        [::std::mem::offset_of!(SherpaOnnxKeywordResult, keyword) - 0usize];
    ["Offset of field: SherpaOnnxKeywordResult::tokens"]
        [::std::mem::offset_of!(SherpaOnnxKeywordResult, tokens) - 8usize];
    ["Offset of field: SherpaOnnxKeywordResult::tokens_arr"]
        [::std::mem::offset_of!(SherpaOnnxKeywordResult, tokens_arr) - 16usize];
    ["Offset of field: SherpaOnnxKeywordResult::count"]
        [::std::mem::offset_of!(SherpaOnnxKeywordResult, count) - 24usize];
    ["Offset of field: SherpaOnnxKeywordResult::timestamps"]
        [::std::mem::offset_of!(SherpaOnnxKeywordResult, timestamps) - 32usize];
    ["Offset of field: SherpaOnnxKeywordResult::start_time"]
        [::std::mem::offset_of!(SherpaOnnxKeywordResult, start_time) - 40usize];
    ["Offset of field: SherpaOnnxKeywordResult::json"]
        [::std::mem::offset_of!(SherpaOnnxKeywordResult, json) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxKeywordSpotterConfig {
    pub feat_config: SherpaOnnxFeatureConfig,
    pub model_config: SherpaOnnxOnlineModelConfig,
    pub max_active_paths: i32,
    pub num_trailing_blanks: i32,
    pub keywords_score: f32,
    pub keywords_threshold: f32,
    pub keywords_file: *const ::std::os::raw::c_char,
    #[doc = " if non-null, loading the keywords from the buffer instead of from the\n keywords_file"]
    pub keywords_buf: *const ::std::os::raw::c_char,
    #[doc = " byte size excluding the trailing '\\0'"]
    pub keywords_buf_size: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxKeywordSpotterConfig"]
        [::std::mem::size_of::<SherpaOnnxKeywordSpotterConfig>() - 184usize];
    ["Alignment of SherpaOnnxKeywordSpotterConfig"]
        [::std::mem::align_of::<SherpaOnnxKeywordSpotterConfig>() - 8usize];
    ["Offset of field: SherpaOnnxKeywordSpotterConfig::feat_config"]
        [::std::mem::offset_of!(SherpaOnnxKeywordSpotterConfig, feat_config) - 0usize];
    ["Offset of field: SherpaOnnxKeywordSpotterConfig::model_config"]
        [::std::mem::offset_of!(SherpaOnnxKeywordSpotterConfig, model_config) - 8usize];
    ["Offset of field: SherpaOnnxKeywordSpotterConfig::max_active_paths"]
        [::std::mem::offset_of!(SherpaOnnxKeywordSpotterConfig, max_active_paths) - 144usize];
    ["Offset of field: SherpaOnnxKeywordSpotterConfig::num_trailing_blanks"]
        [::std::mem::offset_of!(SherpaOnnxKeywordSpotterConfig, num_trailing_blanks) - 148usize];
    ["Offset of field: SherpaOnnxKeywordSpotterConfig::keywords_score"]
        [::std::mem::offset_of!(SherpaOnnxKeywordSpotterConfig, keywords_score) - 152usize];
    ["Offset of field: SherpaOnnxKeywordSpotterConfig::keywords_threshold"]
        [::std::mem::offset_of!(SherpaOnnxKeywordSpotterConfig, keywords_threshold) - 156usize];
    ["Offset of field: SherpaOnnxKeywordSpotterConfig::keywords_file"]
        [::std::mem::offset_of!(SherpaOnnxKeywordSpotterConfig, keywords_file) - 160usize];
    ["Offset of field: SherpaOnnxKeywordSpotterConfig::keywords_buf"]
        [::std::mem::offset_of!(SherpaOnnxKeywordSpotterConfig, keywords_buf) - 168usize];
    ["Offset of field: SherpaOnnxKeywordSpotterConfig::keywords_buf_size"]
        [::std::mem::offset_of!(SherpaOnnxKeywordSpotterConfig, keywords_buf_size) - 176usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxKeywordSpotter {
    _unused: [u8; 0],
}
unsafe extern "C" {
    #[doc = " @param config  Config for the keyword spotter.\n @return Return a pointer to the spotter. The user has to invoke\n         SherpaOnnxDestroyKeywordSpotter() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateKeywordSpotter(
        config: *const SherpaOnnxKeywordSpotterConfig,
    ) -> *const SherpaOnnxKeywordSpotter;
}
unsafe extern "C" {
    #[doc = " Free a pointer returned by SherpaOnnxCreateKeywordSpotter()\n\n @param p A pointer returned by SherpaOnnxCreateKeywordSpotter()"]
    pub fn SherpaOnnxDestroyKeywordSpotter(spotter: *const SherpaOnnxKeywordSpotter);
}
unsafe extern "C" {
    #[doc = " Create an online stream for accepting wave samples.\n\n @param spotter A pointer returned by SherpaOnnxCreateKeywordSpotter()\n @return Return a pointer to an OnlineStream. The user has to invoke\n         SherpaOnnxDestroyOnlineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateKeywordStream(
        spotter: *const SherpaOnnxKeywordSpotter,
    ) -> *const SherpaOnnxOnlineStream;
}
unsafe extern "C" {
    #[doc = " Create an online stream for accepting wave samples with the specified hot\n words.\n\n @param spotter A pointer returned by SherpaOnnxCreateKeywordSpotter()\n @param keywords A pointer points to the keywords that you set\n @return Return a pointer to an OnlineStream. The user has to invoke\n         SherpaOnnxDestroyOnlineStream() to free it to avoid memory leak."]
    pub fn SherpaOnnxCreateKeywordStreamWithKeywords(
        spotter: *const SherpaOnnxKeywordSpotter,
        keywords: *const ::std::os::raw::c_char,
    ) -> *const SherpaOnnxOnlineStream;
}
unsafe extern "C" {
    #[doc = " Return 1 if there are enough number of feature frames for decoding.\n Return 0 otherwise.\n\n @param spotter A pointer returned by SherpaOnnxCreateKeywordSpotter\n @param stream  A pointer returned by SherpaOnnxCreateKeywordStream"]
    pub fn SherpaOnnxIsKeywordStreamReady(
        spotter: *const SherpaOnnxKeywordSpotter,
        stream: *const SherpaOnnxOnlineStream,
    ) -> i32;
}
unsafe extern "C" {
    #[doc = " Precondition for this function: SherpaOnnxIsKeywordStreamReady() MUST\n return 1."]
    pub fn SherpaOnnxDecodeKeywordStream(
        spotter: *const SherpaOnnxKeywordSpotter,
        stream: *const SherpaOnnxOnlineStream,
    );
}
unsafe extern "C" {
    #[doc = " Please call it right after a keyword is detected"]
    pub fn SherpaOnnxResetKeywordStream(
        spotter: *const SherpaOnnxKeywordSpotter,
        stream: *const SherpaOnnxOnlineStream,
    );
}
unsafe extern "C" {
    #[doc = " This function is similar to SherpaOnnxDecodeKeywordStream(). It decodes\n multiple OnlineStream in parallel.\n\n Caution: The caller has to ensure each OnlineStream is ready, i.e.,\n SherpaOnnxIsKeywordStreamReady() for that stream should return 1.\n\n @param spotter A pointer returned by SherpaOnnxCreateKeywordSpotter()\n @param streams  A pointer array containing pointers returned by\n                 SherpaOnnxCreateKeywordStream()\n @param n  Number of elements in the given streams array."]
    pub fn SherpaOnnxDecodeMultipleKeywordStreams(
        spotter: *const SherpaOnnxKeywordSpotter,
        streams: *mut *const SherpaOnnxOnlineStream,
        n: i32,
    );
}
unsafe extern "C" {
    #[doc = " Get the decoding results so far for an OnlineStream.\n\n @param spotter A pointer returned by SherpaOnnxCreateKeywordSpotter().\n @param stream A pointer returned by SherpaOnnxCreateKeywordStream().\n @return A pointer containing the result. The user has to invoke\n         SherpaOnnxDestroyKeywordResult() to free the returned pointer to\n         avoid memory leak."]
    pub fn SherpaOnnxGetKeywordResult(
        spotter: *const SherpaOnnxKeywordSpotter,
        stream: *const SherpaOnnxOnlineStream,
    ) -> *const SherpaOnnxKeywordResult;
}
unsafe extern "C" {
    #[doc = " Destroy the pointer returned by SherpaOnnxGetKeywordResult().\n\n @param r A pointer returned by SherpaOnnxGetKeywordResult()"]
    pub fn SherpaOnnxDestroyKeywordResult(r: *const SherpaOnnxKeywordResult);
}
unsafe extern "C" {
    pub fn SherpaOnnxGetKeywordResultAsJson(
        spotter: *const SherpaOnnxKeywordSpotter,
        stream: *const SherpaOnnxOnlineStream,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn SherpaOnnxFreeKeywordResultJson(s: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSileroVadModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub threshold: f32,
    pub min_silence_duration: f32,
    pub min_speech_duration: f32,
    pub window_size: i32,
    pub max_speech_duration: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxSileroVadModelConfig"]
        [::std::mem::size_of::<SherpaOnnxSileroVadModelConfig>() - 32usize];
    ["Alignment of SherpaOnnxSileroVadModelConfig"]
        [::std::mem::align_of::<SherpaOnnxSileroVadModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxSileroVadModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxSileroVadModelConfig, model) - 0usize];
    ["Offset of field: SherpaOnnxSileroVadModelConfig::threshold"]
        [::std::mem::offset_of!(SherpaOnnxSileroVadModelConfig, threshold) - 8usize];
    ["Offset of field: SherpaOnnxSileroVadModelConfig::min_silence_duration"]
        [::std::mem::offset_of!(SherpaOnnxSileroVadModelConfig, min_silence_duration) - 12usize];
    ["Offset of field: SherpaOnnxSileroVadModelConfig::min_speech_duration"]
        [::std::mem::offset_of!(SherpaOnnxSileroVadModelConfig, min_speech_duration) - 16usize];
    ["Offset of field: SherpaOnnxSileroVadModelConfig::window_size"]
        [::std::mem::offset_of!(SherpaOnnxSileroVadModelConfig, window_size) - 20usize];
    ["Offset of field: SherpaOnnxSileroVadModelConfig::max_speech_duration"]
        [::std::mem::offset_of!(SherpaOnnxSileroVadModelConfig, max_speech_duration) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxTenVadModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub threshold: f32,
    pub min_silence_duration: f32,
    pub min_speech_duration: f32,
    pub window_size: i32,
    pub max_speech_duration: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxTenVadModelConfig"]
        [::std::mem::size_of::<SherpaOnnxTenVadModelConfig>() - 32usize];
    ["Alignment of SherpaOnnxTenVadModelConfig"]
        [::std::mem::align_of::<SherpaOnnxTenVadModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxTenVadModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxTenVadModelConfig, model) - 0usize];
    ["Offset of field: SherpaOnnxTenVadModelConfig::threshold"]
        [::std::mem::offset_of!(SherpaOnnxTenVadModelConfig, threshold) - 8usize];
    ["Offset of field: SherpaOnnxTenVadModelConfig::min_silence_duration"]
        [::std::mem::offset_of!(SherpaOnnxTenVadModelConfig, min_silence_duration) - 12usize];
    ["Offset of field: SherpaOnnxTenVadModelConfig::min_speech_duration"]
        [::std::mem::offset_of!(SherpaOnnxTenVadModelConfig, min_speech_duration) - 16usize];
    ["Offset of field: SherpaOnnxTenVadModelConfig::window_size"]
        [::std::mem::offset_of!(SherpaOnnxTenVadModelConfig, window_size) - 20usize];
    ["Offset of field: SherpaOnnxTenVadModelConfig::max_speech_duration"]
        [::std::mem::offset_of!(SherpaOnnxTenVadModelConfig, max_speech_duration) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxVadModelConfig {
    pub silero_vad: SherpaOnnxSileroVadModelConfig,
    pub sample_rate: i32,
    pub num_threads: i32,
    pub provider: *const ::std::os::raw::c_char,
    pub debug: i32,
    pub ten_vad: SherpaOnnxTenVadModelConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxVadModelConfig"]
        [::std::mem::size_of::<SherpaOnnxVadModelConfig>() - 88usize];
    ["Alignment of SherpaOnnxVadModelConfig"]
        [::std::mem::align_of::<SherpaOnnxVadModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxVadModelConfig::silero_vad"]
        [::std::mem::offset_of!(SherpaOnnxVadModelConfig, silero_vad) - 0usize];
    ["Offset of field: SherpaOnnxVadModelConfig::sample_rate"]
        [::std::mem::offset_of!(SherpaOnnxVadModelConfig, sample_rate) - 32usize];
    ["Offset of field: SherpaOnnxVadModelConfig::num_threads"]
        [::std::mem::offset_of!(SherpaOnnxVadModelConfig, num_threads) - 36usize];
    ["Offset of field: SherpaOnnxVadModelConfig::provider"]
        [::std::mem::offset_of!(SherpaOnnxVadModelConfig, provider) - 40usize];
    ["Offset of field: SherpaOnnxVadModelConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxVadModelConfig, debug) - 48usize];
    ["Offset of field: SherpaOnnxVadModelConfig::ten_vad"]
        [::std::mem::offset_of!(SherpaOnnxVadModelConfig, ten_vad) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxCircularBuffer {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateCircularBuffer(capacity: i32) -> *const SherpaOnnxCircularBuffer;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyCircularBuffer(buffer: *const SherpaOnnxCircularBuffer);
}
unsafe extern "C" {
    pub fn SherpaOnnxCircularBufferPush(
        buffer: *const SherpaOnnxCircularBuffer,
        p: *const f32,
        n: i32,
    );
}
unsafe extern "C" {
    pub fn SherpaOnnxCircularBufferGet(
        buffer: *const SherpaOnnxCircularBuffer,
        start_index: i32,
        n: i32,
    ) -> *const f32;
}
unsafe extern "C" {
    pub fn SherpaOnnxCircularBufferFree(p: *const f32);
}
unsafe extern "C" {
    pub fn SherpaOnnxCircularBufferPop(buffer: *const SherpaOnnxCircularBuffer, n: i32);
}
unsafe extern "C" {
    pub fn SherpaOnnxCircularBufferSize(buffer: *const SherpaOnnxCircularBuffer) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxCircularBufferHead(buffer: *const SherpaOnnxCircularBuffer) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxCircularBufferReset(buffer: *const SherpaOnnxCircularBuffer);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeechSegment {
    pub start: i32,
    pub samples: *mut f32,
    pub n: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxSpeechSegment"][::std::mem::size_of::<SherpaOnnxSpeechSegment>() - 24usize];
    ["Alignment of SherpaOnnxSpeechSegment"]
        [::std::mem::align_of::<SherpaOnnxSpeechSegment>() - 8usize];
    ["Offset of field: SherpaOnnxSpeechSegment::start"]
        [::std::mem::offset_of!(SherpaOnnxSpeechSegment, start) - 0usize];
    ["Offset of field: SherpaOnnxSpeechSegment::samples"]
        [::std::mem::offset_of!(SherpaOnnxSpeechSegment, samples) - 8usize];
    ["Offset of field: SherpaOnnxSpeechSegment::n"]
        [::std::mem::offset_of!(SherpaOnnxSpeechSegment, n) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxVoiceActivityDetector {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateVoiceActivityDetector(
        config: *const SherpaOnnxVadModelConfig,
        buffer_size_in_seconds: f32,
    ) -> *const SherpaOnnxVoiceActivityDetector;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyVoiceActivityDetector(p: *const SherpaOnnxVoiceActivityDetector);
}
unsafe extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorAcceptWaveform(
        p: *const SherpaOnnxVoiceActivityDetector,
        samples: *const f32,
        n: i32,
    );
}
unsafe extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorEmpty(p: *const SherpaOnnxVoiceActivityDetector) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorDetected(
        p: *const SherpaOnnxVoiceActivityDetector,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorPop(p: *const SherpaOnnxVoiceActivityDetector);
}
unsafe extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorClear(p: *const SherpaOnnxVoiceActivityDetector);
}
unsafe extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorFront(
        p: *const SherpaOnnxVoiceActivityDetector,
    ) -> *const SherpaOnnxSpeechSegment;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroySpeechSegment(p: *const SherpaOnnxSpeechSegment);
}
unsafe extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorReset(p: *const SherpaOnnxVoiceActivityDetector);
}
unsafe extern "C" {
    pub fn SherpaOnnxVoiceActivityDetectorFlush(p: *const SherpaOnnxVoiceActivityDetector);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsVitsModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub lexicon: *const ::std::os::raw::c_char,
    pub tokens: *const ::std::os::raw::c_char,
    pub data_dir: *const ::std::os::raw::c_char,
    pub noise_scale: f32,
    pub noise_scale_w: f32,
    pub length_scale: f32,
    pub dict_dir: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineTtsVitsModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineTtsVitsModelConfig>() - 56usize];
    ["Alignment of SherpaOnnxOfflineTtsVitsModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineTtsVitsModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsVitsModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsVitsModelConfig, model) - 0usize];
    ["Offset of field: SherpaOnnxOfflineTtsVitsModelConfig::lexicon"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsVitsModelConfig, lexicon) - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsVitsModelConfig::tokens"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsVitsModelConfig, tokens) - 16usize];
    ["Offset of field: SherpaOnnxOfflineTtsVitsModelConfig::data_dir"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsVitsModelConfig, data_dir) - 24usize];
    ["Offset of field: SherpaOnnxOfflineTtsVitsModelConfig::noise_scale"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsVitsModelConfig, noise_scale) - 32usize];
    ["Offset of field: SherpaOnnxOfflineTtsVitsModelConfig::noise_scale_w"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsVitsModelConfig, noise_scale_w) - 36usize];
    ["Offset of field: SherpaOnnxOfflineTtsVitsModelConfig::length_scale"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsVitsModelConfig, length_scale) - 40usize];
    ["Offset of field: SherpaOnnxOfflineTtsVitsModelConfig::dict_dir"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsVitsModelConfig, dict_dir) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsMatchaModelConfig {
    pub acoustic_model: *const ::std::os::raw::c_char,
    pub vocoder: *const ::std::os::raw::c_char,
    pub lexicon: *const ::std::os::raw::c_char,
    pub tokens: *const ::std::os::raw::c_char,
    pub data_dir: *const ::std::os::raw::c_char,
    pub noise_scale: f32,
    pub length_scale: f32,
    pub dict_dir: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineTtsMatchaModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineTtsMatchaModelConfig>() - 56usize];
    ["Alignment of SherpaOnnxOfflineTtsMatchaModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineTtsMatchaModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsMatchaModelConfig::acoustic_model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsMatchaModelConfig, acoustic_model) - 0usize];
    ["Offset of field: SherpaOnnxOfflineTtsMatchaModelConfig::vocoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsMatchaModelConfig, vocoder) - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsMatchaModelConfig::lexicon"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsMatchaModelConfig, lexicon) - 16usize];
    ["Offset of field: SherpaOnnxOfflineTtsMatchaModelConfig::tokens"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsMatchaModelConfig, tokens) - 24usize];
    ["Offset of field: SherpaOnnxOfflineTtsMatchaModelConfig::data_dir"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsMatchaModelConfig, data_dir) - 32usize];
    ["Offset of field: SherpaOnnxOfflineTtsMatchaModelConfig::noise_scale"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsMatchaModelConfig, noise_scale) - 40usize];
    ["Offset of field: SherpaOnnxOfflineTtsMatchaModelConfig::length_scale"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsMatchaModelConfig, length_scale) - 44usize];
    ["Offset of field: SherpaOnnxOfflineTtsMatchaModelConfig::dict_dir"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsMatchaModelConfig, dict_dir) - 48usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsKokoroModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub voices: *const ::std::os::raw::c_char,
    pub tokens: *const ::std::os::raw::c_char,
    pub data_dir: *const ::std::os::raw::c_char,
    pub length_scale: f32,
    pub dict_dir: *const ::std::os::raw::c_char,
    pub lexicon: *const ::std::os::raw::c_char,
    pub lang: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineTtsKokoroModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineTtsKokoroModelConfig>() - 64usize];
    ["Alignment of SherpaOnnxOfflineTtsKokoroModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineTtsKokoroModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsKokoroModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKokoroModelConfig, model) - 0usize];
    ["Offset of field: SherpaOnnxOfflineTtsKokoroModelConfig::voices"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKokoroModelConfig, voices) - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsKokoroModelConfig::tokens"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKokoroModelConfig, tokens) - 16usize];
    ["Offset of field: SherpaOnnxOfflineTtsKokoroModelConfig::data_dir"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKokoroModelConfig, data_dir) - 24usize];
    ["Offset of field: SherpaOnnxOfflineTtsKokoroModelConfig::length_scale"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKokoroModelConfig, length_scale) - 32usize];
    ["Offset of field: SherpaOnnxOfflineTtsKokoroModelConfig::dict_dir"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKokoroModelConfig, dict_dir) - 40usize];
    ["Offset of field: SherpaOnnxOfflineTtsKokoroModelConfig::lexicon"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKokoroModelConfig, lexicon) - 48usize];
    ["Offset of field: SherpaOnnxOfflineTtsKokoroModelConfig::lang"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKokoroModelConfig, lang) - 56usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsKittenModelConfig {
    pub model: *const ::std::os::raw::c_char,
    pub voices: *const ::std::os::raw::c_char,
    pub tokens: *const ::std::os::raw::c_char,
    pub data_dir: *const ::std::os::raw::c_char,
    pub length_scale: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineTtsKittenModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineTtsKittenModelConfig>() - 40usize];
    ["Alignment of SherpaOnnxOfflineTtsKittenModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineTtsKittenModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsKittenModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKittenModelConfig, model) - 0usize];
    ["Offset of field: SherpaOnnxOfflineTtsKittenModelConfig::voices"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKittenModelConfig, voices) - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsKittenModelConfig::tokens"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKittenModelConfig, tokens) - 16usize];
    ["Offset of field: SherpaOnnxOfflineTtsKittenModelConfig::data_dir"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKittenModelConfig, data_dir) - 24usize];
    ["Offset of field: SherpaOnnxOfflineTtsKittenModelConfig::length_scale"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsKittenModelConfig, length_scale) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsZipvoiceModelConfig {
    pub tokens: *const ::std::os::raw::c_char,
    pub text_model: *const ::std::os::raw::c_char,
    pub flow_matching_model: *const ::std::os::raw::c_char,
    pub vocoder: *const ::std::os::raw::c_char,
    pub data_dir: *const ::std::os::raw::c_char,
    pub pinyin_dict: *const ::std::os::raw::c_char,
    pub feat_scale: f32,
    pub t_shift: f32,
    pub target_rms: f32,
    pub guidance_scale: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineTtsZipvoiceModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineTtsZipvoiceModelConfig>() - 64usize];
    ["Alignment of SherpaOnnxOfflineTtsZipvoiceModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineTtsZipvoiceModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsZipvoiceModelConfig::tokens"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsZipvoiceModelConfig, tokens) - 0usize];
    ["Offset of field: SherpaOnnxOfflineTtsZipvoiceModelConfig::text_model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsZipvoiceModelConfig, text_model) - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsZipvoiceModelConfig::flow_matching_model"][::std::mem::offset_of!(
        SherpaOnnxOfflineTtsZipvoiceModelConfig,
        flow_matching_model
    ) - 16usize];
    ["Offset of field: SherpaOnnxOfflineTtsZipvoiceModelConfig::vocoder"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsZipvoiceModelConfig, vocoder) - 24usize];
    ["Offset of field: SherpaOnnxOfflineTtsZipvoiceModelConfig::data_dir"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsZipvoiceModelConfig, data_dir) - 32usize];
    ["Offset of field: SherpaOnnxOfflineTtsZipvoiceModelConfig::pinyin_dict"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsZipvoiceModelConfig, pinyin_dict) - 40usize];
    ["Offset of field: SherpaOnnxOfflineTtsZipvoiceModelConfig::feat_scale"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsZipvoiceModelConfig, feat_scale) - 48usize];
    ["Offset of field: SherpaOnnxOfflineTtsZipvoiceModelConfig::t_shift"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsZipvoiceModelConfig, t_shift) - 52usize];
    ["Offset of field: SherpaOnnxOfflineTtsZipvoiceModelConfig::target_rms"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsZipvoiceModelConfig, target_rms) - 56usize];
    ["Offset of field: SherpaOnnxOfflineTtsZipvoiceModelConfig::guidance_scale"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsZipvoiceModelConfig, guidance_scale) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsModelConfig {
    pub vits: SherpaOnnxOfflineTtsVitsModelConfig,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
    pub matcha: SherpaOnnxOfflineTtsMatchaModelConfig,
    pub kokoro: SherpaOnnxOfflineTtsKokoroModelConfig,
    pub kitten: SherpaOnnxOfflineTtsKittenModelConfig,
    pub zipvoice: SherpaOnnxOfflineTtsZipvoiceModelConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineTtsModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineTtsModelConfig>() - 296usize];
    ["Alignment of SherpaOnnxOfflineTtsModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineTtsModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsModelConfig::vits"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsModelConfig, vits) - 0usize];
    ["Offset of field: SherpaOnnxOfflineTtsModelConfig::num_threads"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsModelConfig, num_threads) - 56usize];
    ["Offset of field: SherpaOnnxOfflineTtsModelConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsModelConfig, debug) - 60usize];
    ["Offset of field: SherpaOnnxOfflineTtsModelConfig::provider"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsModelConfig, provider) - 64usize];
    ["Offset of field: SherpaOnnxOfflineTtsModelConfig::matcha"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsModelConfig, matcha) - 72usize];
    ["Offset of field: SherpaOnnxOfflineTtsModelConfig::kokoro"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsModelConfig, kokoro) - 128usize];
    ["Offset of field: SherpaOnnxOfflineTtsModelConfig::kitten"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsModelConfig, kitten) - 192usize];
    ["Offset of field: SherpaOnnxOfflineTtsModelConfig::zipvoice"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsModelConfig, zipvoice) - 232usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTtsConfig {
    pub model: SherpaOnnxOfflineTtsModelConfig,
    pub rule_fsts: *const ::std::os::raw::c_char,
    pub max_num_sentences: i32,
    pub rule_fars: *const ::std::os::raw::c_char,
    pub silence_scale: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineTtsConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineTtsConfig>() - 328usize];
    ["Alignment of SherpaOnnxOfflineTtsConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineTtsConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineTtsConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsConfig, model) - 0usize];
    ["Offset of field: SherpaOnnxOfflineTtsConfig::rule_fsts"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsConfig, rule_fsts) - 296usize];
    ["Offset of field: SherpaOnnxOfflineTtsConfig::max_num_sentences"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsConfig, max_num_sentences) - 304usize];
    ["Offset of field: SherpaOnnxOfflineTtsConfig::rule_fars"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsConfig, rule_fars) - 312usize];
    ["Offset of field: SherpaOnnxOfflineTtsConfig::silence_scale"]
        [::std::mem::offset_of!(SherpaOnnxOfflineTtsConfig, silence_scale) - 320usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxGeneratedAudio {
    pub samples: *const f32,
    pub n: i32,
    pub sample_rate: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxGeneratedAudio"]
        [::std::mem::size_of::<SherpaOnnxGeneratedAudio>() - 16usize];
    ["Alignment of SherpaOnnxGeneratedAudio"]
        [::std::mem::align_of::<SherpaOnnxGeneratedAudio>() - 8usize];
    ["Offset of field: SherpaOnnxGeneratedAudio::samples"]
        [::std::mem::offset_of!(SherpaOnnxGeneratedAudio, samples) - 0usize];
    ["Offset of field: SherpaOnnxGeneratedAudio::n"]
        [::std::mem::offset_of!(SherpaOnnxGeneratedAudio, n) - 8usize];
    ["Offset of field: SherpaOnnxGeneratedAudio::sample_rate"]
        [::std::mem::offset_of!(SherpaOnnxGeneratedAudio, sample_rate) - 12usize];
};
pub type SherpaOnnxGeneratedAudioCallback =
    ::std::option::Option<unsafe extern "C" fn(samples: *const f32, n: i32) -> i32>;
pub type SherpaOnnxGeneratedAudioCallbackWithArg = ::std::option::Option<
    unsafe extern "C" fn(samples: *const f32, n: i32, arg: *mut ::std::os::raw::c_void) -> i32,
>;
pub type SherpaOnnxGeneratedAudioProgressCallback =
    ::std::option::Option<unsafe extern "C" fn(samples: *const f32, n: i32, p: f32) -> i32>;
pub type SherpaOnnxGeneratedAudioProgressCallbackWithArg = ::std::option::Option<
    unsafe extern "C" fn(
        samples: *const f32,
        n: i32,
        p: f32,
        arg: *mut ::std::os::raw::c_void,
    ) -> i32,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineTts {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateOfflineTts(
        config: *const SherpaOnnxOfflineTtsConfig,
    ) -> *const SherpaOnnxOfflineTts;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyOfflineTts(tts: *const SherpaOnnxOfflineTts);
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineTtsSampleRate(tts: *const SherpaOnnxOfflineTts) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineTtsNumSpeakers(tts: *const SherpaOnnxOfflineTts) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerate(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        sid: i32,
        speed: f32,
    ) -> *const SherpaOnnxGeneratedAudio;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithCallback(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        sid: i32,
        speed: f32,
        callback: SherpaOnnxGeneratedAudioCallback,
    ) -> *const SherpaOnnxGeneratedAudio;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithProgressCallback(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        sid: i32,
        speed: f32,
        callback: SherpaOnnxGeneratedAudioProgressCallback,
    ) -> *const SherpaOnnxGeneratedAudio;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithProgressCallbackWithArg(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        sid: i32,
        speed: f32,
        callback: SherpaOnnxGeneratedAudioProgressCallbackWithArg,
        arg: *mut ::std::os::raw::c_void,
    ) -> *const SherpaOnnxGeneratedAudio;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithCallbackWithArg(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        sid: i32,
        speed: f32,
        callback: SherpaOnnxGeneratedAudioCallbackWithArg,
        arg: *mut ::std::os::raw::c_void,
    ) -> *const SherpaOnnxGeneratedAudio;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineTtsGenerateWithZipvoice(
        tts: *const SherpaOnnxOfflineTts,
        text: *const ::std::os::raw::c_char,
        prompt_text: *const ::std::os::raw::c_char,
        prompt_samples: *const f32,
        n_prompt: i32,
        prompt_sr: i32,
        speed: f32,
        num_steps: i32,
    ) -> *const SherpaOnnxGeneratedAudio;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyOfflineTtsGeneratedAudio(p: *const SherpaOnnxGeneratedAudio);
}
unsafe extern "C" {
    pub fn SherpaOnnxWriteWave(
        samples: *const f32,
        n: i32,
        sample_rate: i32,
        filename: *const ::std::os::raw::c_char,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxWaveFileSize(n_samples: i32) -> i64;
}
unsafe extern "C" {
    pub fn SherpaOnnxWriteWaveToBuffer(
        samples: *const f32,
        n: i32,
        sample_rate: i32,
        buffer: *mut ::std::os::raw::c_char,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxWave {
    pub samples: *const f32,
    pub sample_rate: i32,
    pub num_samples: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxWave"][::std::mem::size_of::<SherpaOnnxWave>() - 16usize];
    ["Alignment of SherpaOnnxWave"][::std::mem::align_of::<SherpaOnnxWave>() - 8usize];
    ["Offset of field: SherpaOnnxWave::samples"]
        [::std::mem::offset_of!(SherpaOnnxWave, samples) - 0usize];
    ["Offset of field: SherpaOnnxWave::sample_rate"]
        [::std::mem::offset_of!(SherpaOnnxWave, sample_rate) - 8usize];
    ["Offset of field: SherpaOnnxWave::num_samples"]
        [::std::mem::offset_of!(SherpaOnnxWave, num_samples) - 12usize];
};
unsafe extern "C" {
    pub fn SherpaOnnxReadWave(filename: *const ::std::os::raw::c_char) -> *const SherpaOnnxWave;
}
unsafe extern "C" {
    pub fn SherpaOnnxReadWaveFromBinaryData(
        data: *const ::std::os::raw::c_char,
        n: i32,
    ) -> *const SherpaOnnxWave;
}
unsafe extern "C" {
    pub fn SherpaOnnxFreeWave(wave: *const SherpaOnnxWave);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpokenLanguageIdentificationWhisperConfig {
    pub encoder: *const ::std::os::raw::c_char,
    pub decoder: *const ::std::os::raw::c_char,
    pub tail_paddings: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxSpokenLanguageIdentificationWhisperConfig"]
        [::std::mem::size_of::<SherpaOnnxSpokenLanguageIdentificationWhisperConfig>() - 24usize];
    ["Alignment of SherpaOnnxSpokenLanguageIdentificationWhisperConfig"]
        [::std::mem::align_of::<SherpaOnnxSpokenLanguageIdentificationWhisperConfig>() - 8usize];
    ["Offset of field: SherpaOnnxSpokenLanguageIdentificationWhisperConfig::encoder"][::std::mem::offset_of!(
        SherpaOnnxSpokenLanguageIdentificationWhisperConfig,
        encoder
    ) - 0usize];
    ["Offset of field: SherpaOnnxSpokenLanguageIdentificationWhisperConfig::decoder"][::std::mem::offset_of!(
        SherpaOnnxSpokenLanguageIdentificationWhisperConfig,
        decoder
    ) - 8usize];
    ["Offset of field: SherpaOnnxSpokenLanguageIdentificationWhisperConfig::tail_paddings"][::std::mem::offset_of!(
        SherpaOnnxSpokenLanguageIdentificationWhisperConfig,
        tail_paddings
    )
        - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpokenLanguageIdentificationConfig {
    pub whisper: SherpaOnnxSpokenLanguageIdentificationWhisperConfig,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxSpokenLanguageIdentificationConfig"]
        [::std::mem::size_of::<SherpaOnnxSpokenLanguageIdentificationConfig>() - 40usize];
    ["Alignment of SherpaOnnxSpokenLanguageIdentificationConfig"]
        [::std::mem::align_of::<SherpaOnnxSpokenLanguageIdentificationConfig>() - 8usize];
    ["Offset of field: SherpaOnnxSpokenLanguageIdentificationConfig::whisper"]
        [::std::mem::offset_of!(SherpaOnnxSpokenLanguageIdentificationConfig, whisper) - 0usize];
    ["Offset of field: SherpaOnnxSpokenLanguageIdentificationConfig::num_threads"][::std::mem::offset_of!(
        SherpaOnnxSpokenLanguageIdentificationConfig,
        num_threads
    ) - 24usize];
    ["Offset of field: SherpaOnnxSpokenLanguageIdentificationConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxSpokenLanguageIdentificationConfig, debug) - 28usize];
    ["Offset of field: SherpaOnnxSpokenLanguageIdentificationConfig::provider"]
        [::std::mem::offset_of!(SherpaOnnxSpokenLanguageIdentificationConfig, provider) - 32usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpokenLanguageIdentification {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateSpokenLanguageIdentification(
        config: *const SherpaOnnxSpokenLanguageIdentificationConfig,
    ) -> *const SherpaOnnxSpokenLanguageIdentification;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroySpokenLanguageIdentification(
        slid: *const SherpaOnnxSpokenLanguageIdentification,
    );
}
unsafe extern "C" {
    pub fn SherpaOnnxSpokenLanguageIdentificationCreateOfflineStream(
        slid: *const SherpaOnnxSpokenLanguageIdentification,
    ) -> *mut SherpaOnnxOfflineStream;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpokenLanguageIdentificationResult {
    pub lang: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxSpokenLanguageIdentificationResult"]
        [::std::mem::size_of::<SherpaOnnxSpokenLanguageIdentificationResult>() - 8usize];
    ["Alignment of SherpaOnnxSpokenLanguageIdentificationResult"]
        [::std::mem::align_of::<SherpaOnnxSpokenLanguageIdentificationResult>() - 8usize];
    ["Offset of field: SherpaOnnxSpokenLanguageIdentificationResult::lang"]
        [::std::mem::offset_of!(SherpaOnnxSpokenLanguageIdentificationResult, lang) - 0usize];
};
unsafe extern "C" {
    pub fn SherpaOnnxSpokenLanguageIdentificationCompute(
        slid: *const SherpaOnnxSpokenLanguageIdentification,
        s: *const SherpaOnnxOfflineStream,
    ) -> *const SherpaOnnxSpokenLanguageIdentificationResult;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroySpokenLanguageIdentificationResult(
        r: *const SherpaOnnxSpokenLanguageIdentificationResult,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeakerEmbeddingExtractorConfig {
    pub model: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxSpeakerEmbeddingExtractorConfig"]
        [::std::mem::size_of::<SherpaOnnxSpeakerEmbeddingExtractorConfig>() - 24usize];
    ["Alignment of SherpaOnnxSpeakerEmbeddingExtractorConfig"]
        [::std::mem::align_of::<SherpaOnnxSpeakerEmbeddingExtractorConfig>() - 8usize];
    ["Offset of field: SherpaOnnxSpeakerEmbeddingExtractorConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxSpeakerEmbeddingExtractorConfig, model) - 0usize];
    ["Offset of field: SherpaOnnxSpeakerEmbeddingExtractorConfig::num_threads"]
        [::std::mem::offset_of!(SherpaOnnxSpeakerEmbeddingExtractorConfig, num_threads) - 8usize];
    ["Offset of field: SherpaOnnxSpeakerEmbeddingExtractorConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxSpeakerEmbeddingExtractorConfig, debug) - 12usize];
    ["Offset of field: SherpaOnnxSpeakerEmbeddingExtractorConfig::provider"]
        [::std::mem::offset_of!(SherpaOnnxSpeakerEmbeddingExtractorConfig, provider) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeakerEmbeddingExtractor {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateSpeakerEmbeddingExtractor(
        config: *const SherpaOnnxSpeakerEmbeddingExtractorConfig,
    ) -> *const SherpaOnnxSpeakerEmbeddingExtractor;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroySpeakerEmbeddingExtractor(
        p: *const SherpaOnnxSpeakerEmbeddingExtractor,
    );
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingExtractorDim(
        p: *const SherpaOnnxSpeakerEmbeddingExtractor,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingExtractorCreateStream(
        p: *const SherpaOnnxSpeakerEmbeddingExtractor,
    ) -> *const SherpaOnnxOnlineStream;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingExtractorIsReady(
        p: *const SherpaOnnxSpeakerEmbeddingExtractor,
        s: *const SherpaOnnxOnlineStream,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingExtractorComputeEmbedding(
        p: *const SherpaOnnxSpeakerEmbeddingExtractor,
        s: *const SherpaOnnxOnlineStream,
    ) -> *const f32;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingExtractorDestroyEmbedding(v: *const f32);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeakerEmbeddingManager {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateSpeakerEmbeddingManager(
        dim: i32,
    ) -> *const SherpaOnnxSpeakerEmbeddingManager;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroySpeakerEmbeddingManager(p: *const SherpaOnnxSpeakerEmbeddingManager);
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerAdd(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
        v: *const f32,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerAddList(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
        v: *mut *const f32,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerAddListFlattened(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
        v: *const f32,
        n: i32,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerRemove(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerSearch(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        v: *const f32,
        threshold: f32,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerFreeSearch(name: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch {
    pub score: f32,
    pub name: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch"]
        [::std::mem::size_of::<SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch>() - 16usize];
    ["Alignment of SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch"]
        [::std::mem::align_of::<SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch>() - 8usize];
    ["Offset of field: SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch::score"]
        [::std::mem::offset_of!(SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch, score) - 0usize];
    ["Offset of field: SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch::name"]
        [::std::mem::offset_of!(SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch, name) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult {
    pub matches: *const SherpaOnnxSpeakerEmbeddingManagerSpeakerMatch,
    pub count: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult"]
        [::std::mem::size_of::<SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult>() - 16usize];
    ["Alignment of SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult"]
        [::std::mem::align_of::<SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult>() - 8usize];
    ["Offset of field: SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult::matches"][::std::mem::offset_of!(
        SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult,
        matches
    ) - 0usize];
    ["Offset of field: SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult::count"][::std::mem::offset_of!(
        SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult,
        count
    ) - 8usize];
};
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerGetBestMatches(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        v: *const f32,
        threshold: f32,
        n: i32,
    ) -> *const SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerFreeBestMatches(
        r: *const SherpaOnnxSpeakerEmbeddingManagerBestMatchesResult,
    );
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerVerify(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
        v: *const f32,
        threshold: f32,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerContains(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
        name: *const ::std::os::raw::c_char,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerNumSpeakers(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerGetAllSpeakers(
        p: *const SherpaOnnxSpeakerEmbeddingManager,
    ) -> *const *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn SherpaOnnxSpeakerEmbeddingManagerFreeAllSpeakers(
        names: *const *const ::std::os::raw::c_char,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineZipformerAudioTaggingModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineZipformerAudioTaggingModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineZipformerAudioTaggingModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOfflineZipformerAudioTaggingModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineZipformerAudioTaggingModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineZipformerAudioTaggingModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineZipformerAudioTaggingModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxAudioTaggingModelConfig {
    pub zipformer: SherpaOnnxOfflineZipformerAudioTaggingModelConfig,
    pub ced: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxAudioTaggingModelConfig"]
        [::std::mem::size_of::<SherpaOnnxAudioTaggingModelConfig>() - 32usize];
    ["Alignment of SherpaOnnxAudioTaggingModelConfig"]
        [::std::mem::align_of::<SherpaOnnxAudioTaggingModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxAudioTaggingModelConfig::zipformer"]
        [::std::mem::offset_of!(SherpaOnnxAudioTaggingModelConfig, zipformer) - 0usize];
    ["Offset of field: SherpaOnnxAudioTaggingModelConfig::ced"]
        [::std::mem::offset_of!(SherpaOnnxAudioTaggingModelConfig, ced) - 8usize];
    ["Offset of field: SherpaOnnxAudioTaggingModelConfig::num_threads"]
        [::std::mem::offset_of!(SherpaOnnxAudioTaggingModelConfig, num_threads) - 16usize];
    ["Offset of field: SherpaOnnxAudioTaggingModelConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxAudioTaggingModelConfig, debug) - 20usize];
    ["Offset of field: SherpaOnnxAudioTaggingModelConfig::provider"]
        [::std::mem::offset_of!(SherpaOnnxAudioTaggingModelConfig, provider) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxAudioTaggingConfig {
    pub model: SherpaOnnxAudioTaggingModelConfig,
    pub labels: *const ::std::os::raw::c_char,
    pub top_k: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxAudioTaggingConfig"]
        [::std::mem::size_of::<SherpaOnnxAudioTaggingConfig>() - 48usize];
    ["Alignment of SherpaOnnxAudioTaggingConfig"]
        [::std::mem::align_of::<SherpaOnnxAudioTaggingConfig>() - 8usize];
    ["Offset of field: SherpaOnnxAudioTaggingConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxAudioTaggingConfig, model) - 0usize];
    ["Offset of field: SherpaOnnxAudioTaggingConfig::labels"]
        [::std::mem::offset_of!(SherpaOnnxAudioTaggingConfig, labels) - 32usize];
    ["Offset of field: SherpaOnnxAudioTaggingConfig::top_k"]
        [::std::mem::offset_of!(SherpaOnnxAudioTaggingConfig, top_k) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxAudioEvent {
    pub name: *const ::std::os::raw::c_char,
    pub index: i32,
    pub prob: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxAudioEvent"][::std::mem::size_of::<SherpaOnnxAudioEvent>() - 16usize];
    ["Alignment of SherpaOnnxAudioEvent"][::std::mem::align_of::<SherpaOnnxAudioEvent>() - 8usize];
    ["Offset of field: SherpaOnnxAudioEvent::name"]
        [::std::mem::offset_of!(SherpaOnnxAudioEvent, name) - 0usize];
    ["Offset of field: SherpaOnnxAudioEvent::index"]
        [::std::mem::offset_of!(SherpaOnnxAudioEvent, index) - 8usize];
    ["Offset of field: SherpaOnnxAudioEvent::prob"]
        [::std::mem::offset_of!(SherpaOnnxAudioEvent, prob) - 12usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxAudioTagging {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateAudioTagging(
        config: *const SherpaOnnxAudioTaggingConfig,
    ) -> *const SherpaOnnxAudioTagging;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyAudioTagging(tagger: *const SherpaOnnxAudioTagging);
}
unsafe extern "C" {
    pub fn SherpaOnnxAudioTaggingCreateOfflineStream(
        tagger: *const SherpaOnnxAudioTagging,
    ) -> *const SherpaOnnxOfflineStream;
}
unsafe extern "C" {
    pub fn SherpaOnnxAudioTaggingCompute(
        tagger: *const SherpaOnnxAudioTagging,
        s: *const SherpaOnnxOfflineStream,
        top_k: i32,
    ) -> *const *const SherpaOnnxAudioEvent;
}
unsafe extern "C" {
    pub fn SherpaOnnxAudioTaggingFreeResults(p: *const *const SherpaOnnxAudioEvent);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflinePunctuationModelConfig {
    pub ct_transformer: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflinePunctuationModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflinePunctuationModelConfig>() - 24usize];
    ["Alignment of SherpaOnnxOfflinePunctuationModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflinePunctuationModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflinePunctuationModelConfig::ct_transformer"]
        [::std::mem::offset_of!(SherpaOnnxOfflinePunctuationModelConfig, ct_transformer) - 0usize];
    ["Offset of field: SherpaOnnxOfflinePunctuationModelConfig::num_threads"]
        [::std::mem::offset_of!(SherpaOnnxOfflinePunctuationModelConfig, num_threads) - 8usize];
    ["Offset of field: SherpaOnnxOfflinePunctuationModelConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxOfflinePunctuationModelConfig, debug) - 12usize];
    ["Offset of field: SherpaOnnxOfflinePunctuationModelConfig::provider"]
        [::std::mem::offset_of!(SherpaOnnxOfflinePunctuationModelConfig, provider) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflinePunctuationConfig {
    pub model: SherpaOnnxOfflinePunctuationModelConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflinePunctuationConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflinePunctuationConfig>() - 24usize];
    ["Alignment of SherpaOnnxOfflinePunctuationConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflinePunctuationConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflinePunctuationConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflinePunctuationConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflinePunctuation {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateOfflinePunctuation(
        config: *const SherpaOnnxOfflinePunctuationConfig,
    ) -> *const SherpaOnnxOfflinePunctuation;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyOfflinePunctuation(punct: *const SherpaOnnxOfflinePunctuation);
}
unsafe extern "C" {
    pub fn SherpaOfflinePunctuationAddPunct(
        punct: *const SherpaOnnxOfflinePunctuation,
        text: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn SherpaOfflinePunctuationFreeText(text: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlinePunctuationModelConfig {
    pub cnn_bilstm: *const ::std::os::raw::c_char,
    pub bpe_vocab: *const ::std::os::raw::c_char,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlinePunctuationModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOnlinePunctuationModelConfig>() - 32usize];
    ["Alignment of SherpaOnnxOnlinePunctuationModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOnlinePunctuationModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOnlinePunctuationModelConfig::cnn_bilstm"]
        [::std::mem::offset_of!(SherpaOnnxOnlinePunctuationModelConfig, cnn_bilstm) - 0usize];
    ["Offset of field: SherpaOnnxOnlinePunctuationModelConfig::bpe_vocab"]
        [::std::mem::offset_of!(SherpaOnnxOnlinePunctuationModelConfig, bpe_vocab) - 8usize];
    ["Offset of field: SherpaOnnxOnlinePunctuationModelConfig::num_threads"]
        [::std::mem::offset_of!(SherpaOnnxOnlinePunctuationModelConfig, num_threads) - 16usize];
    ["Offset of field: SherpaOnnxOnlinePunctuationModelConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxOnlinePunctuationModelConfig, debug) - 20usize];
    ["Offset of field: SherpaOnnxOnlinePunctuationModelConfig::provider"]
        [::std::mem::offset_of!(SherpaOnnxOnlinePunctuationModelConfig, provider) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlinePunctuationConfig {
    pub model: SherpaOnnxOnlinePunctuationModelConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOnlinePunctuationConfig"]
        [::std::mem::size_of::<SherpaOnnxOnlinePunctuationConfig>() - 32usize];
    ["Alignment of SherpaOnnxOnlinePunctuationConfig"]
        [::std::mem::align_of::<SherpaOnnxOnlinePunctuationConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOnlinePunctuationConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOnlinePunctuationConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOnlinePunctuation {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateOnlinePunctuation(
        config: *const SherpaOnnxOnlinePunctuationConfig,
    ) -> *const SherpaOnnxOnlinePunctuation;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyOnlinePunctuation(punctuation: *const SherpaOnnxOnlinePunctuation);
}
unsafe extern "C" {
    pub fn SherpaOnnxOnlinePunctuationAddPunct(
        punctuation: *const SherpaOnnxOnlinePunctuation,
        text: *const ::std::os::raw::c_char,
    ) -> *const ::std::os::raw::c_char;
}
unsafe extern "C" {
    pub fn SherpaOnnxOnlinePunctuationFreeText(text: *const ::std::os::raw::c_char);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxLinearResampler {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateLinearResampler(
        samp_rate_in_hz: i32,
        samp_rate_out_hz: i32,
        filter_cutoff_hz: f32,
        num_zeros: i32,
    ) -> *const SherpaOnnxLinearResampler;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyLinearResampler(p: *const SherpaOnnxLinearResampler);
}
unsafe extern "C" {
    pub fn SherpaOnnxLinearResamplerReset(p: *const SherpaOnnxLinearResampler);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxResampleOut {
    pub samples: *const f32,
    pub n: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxResampleOut"][::std::mem::size_of::<SherpaOnnxResampleOut>() - 16usize];
    ["Alignment of SherpaOnnxResampleOut"]
        [::std::mem::align_of::<SherpaOnnxResampleOut>() - 8usize];
    ["Offset of field: SherpaOnnxResampleOut::samples"]
        [::std::mem::offset_of!(SherpaOnnxResampleOut, samples) - 0usize];
    ["Offset of field: SherpaOnnxResampleOut::n"]
        [::std::mem::offset_of!(SherpaOnnxResampleOut, n) - 8usize];
};
unsafe extern "C" {
    pub fn SherpaOnnxLinearResamplerResample(
        p: *const SherpaOnnxLinearResampler,
        input: *const f32,
        input_dim: i32,
        flush: i32,
    ) -> *const SherpaOnnxResampleOut;
}
unsafe extern "C" {
    pub fn SherpaOnnxLinearResamplerResampleFree(p: *const SherpaOnnxResampleOut);
}
unsafe extern "C" {
    pub fn SherpaOnnxLinearResamplerResampleGetInputSampleRate(
        p: *const SherpaOnnxLinearResampler,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxLinearResamplerResampleGetOutputSampleRate(
        p: *const SherpaOnnxLinearResampler,
    ) -> i32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig"][::std::mem::align_of::<
        SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig,
    >() - 8usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig::model"][::std::mem::offset_of!(
        SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig,
        model
    ) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerSegmentationModelConfig {
    pub pyannote: SherpaOnnxOfflineSpeakerSegmentationPyannoteModelConfig,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineSpeakerSegmentationModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineSpeakerSegmentationModelConfig>() - 24usize];
    ["Alignment of SherpaOnnxOfflineSpeakerSegmentationModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineSpeakerSegmentationModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerSegmentationModelConfig::pyannote"][::std::mem::offset_of!(
        SherpaOnnxOfflineSpeakerSegmentationModelConfig,
        pyannote
    ) - 0usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerSegmentationModelConfig::num_threads"][::std::mem::offset_of!(
        SherpaOnnxOfflineSpeakerSegmentationModelConfig,
        num_threads
    ) - 8usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerSegmentationModelConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeakerSegmentationModelConfig, debug) - 12usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerSegmentationModelConfig::provider"][::std::mem::offset_of!(
        SherpaOnnxOfflineSpeakerSegmentationModelConfig,
        provider
    ) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxFastClusteringConfig {
    pub num_clusters: i32,
    pub threshold: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxFastClusteringConfig"]
        [::std::mem::size_of::<SherpaOnnxFastClusteringConfig>() - 8usize];
    ["Alignment of SherpaOnnxFastClusteringConfig"]
        [::std::mem::align_of::<SherpaOnnxFastClusteringConfig>() - 4usize];
    ["Offset of field: SherpaOnnxFastClusteringConfig::num_clusters"]
        [::std::mem::offset_of!(SherpaOnnxFastClusteringConfig, num_clusters) - 0usize];
    ["Offset of field: SherpaOnnxFastClusteringConfig::threshold"]
        [::std::mem::offset_of!(SherpaOnnxFastClusteringConfig, threshold) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerDiarizationConfig {
    pub segmentation: SherpaOnnxOfflineSpeakerSegmentationModelConfig,
    pub embedding: SherpaOnnxSpeakerEmbeddingExtractorConfig,
    pub clustering: SherpaOnnxFastClusteringConfig,
    pub min_duration_on: f32,
    pub min_duration_off: f32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineSpeakerDiarizationConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineSpeakerDiarizationConfig>() - 64usize];
    ["Alignment of SherpaOnnxOfflineSpeakerDiarizationConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineSpeakerDiarizationConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerDiarizationConfig::segmentation"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeakerDiarizationConfig, segmentation) - 0usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerDiarizationConfig::embedding"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeakerDiarizationConfig, embedding) - 24usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerDiarizationConfig::clustering"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeakerDiarizationConfig, clustering) - 48usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerDiarizationConfig::min_duration_on"][::std::mem::offset_of!(
        SherpaOnnxOfflineSpeakerDiarizationConfig,
        min_duration_on
    ) - 56usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerDiarizationConfig::min_duration_off"][::std::mem::offset_of!(
        SherpaOnnxOfflineSpeakerDiarizationConfig,
        min_duration_off
    ) - 60usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerDiarization {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateOfflineSpeakerDiarization(
        config: *const SherpaOnnxOfflineSpeakerDiarizationConfig,
    ) -> *const SherpaOnnxOfflineSpeakerDiarization;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyOfflineSpeakerDiarization(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
    );
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationGetSampleRate(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationSetConfig(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
        config: *const SherpaOnnxOfflineSpeakerDiarizationConfig,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerDiarizationResult {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeakerDiarizationSegment {
    pub start: f32,
    pub end: f32,
    pub speaker: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineSpeakerDiarizationSegment"]
        [::std::mem::size_of::<SherpaOnnxOfflineSpeakerDiarizationSegment>() - 12usize];
    ["Alignment of SherpaOnnxOfflineSpeakerDiarizationSegment"]
        [::std::mem::align_of::<SherpaOnnxOfflineSpeakerDiarizationSegment>() - 4usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerDiarizationSegment::start"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeakerDiarizationSegment, start) - 0usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerDiarizationSegment::end"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeakerDiarizationSegment, end) - 4usize];
    ["Offset of field: SherpaOnnxOfflineSpeakerDiarizationSegment::speaker"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeakerDiarizationSegment, speaker) - 8usize];
};
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationResultGetNumSpeakers(
        r: *const SherpaOnnxOfflineSpeakerDiarizationResult,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationResultGetNumSegments(
        r: *const SherpaOnnxOfflineSpeakerDiarizationResult,
    ) -> i32;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationResultSortByStartTime(
        r: *const SherpaOnnxOfflineSpeakerDiarizationResult,
    ) -> *const SherpaOnnxOfflineSpeakerDiarizationSegment;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationDestroySegment(
        s: *const SherpaOnnxOfflineSpeakerDiarizationSegment,
    );
}
pub type SherpaOnnxOfflineSpeakerDiarizationProgressCallback = ::std::option::Option<
    unsafe extern "C" fn(
        num_processed_chunks: i32,
        num_total_chunks: i32,
        arg: *mut ::std::os::raw::c_void,
    ) -> i32,
>;
pub type SherpaOnnxOfflineSpeakerDiarizationProgressCallbackNoArg = ::std::option::Option<
    unsafe extern "C" fn(num_processed_chunks: i32, num_total_chunks: i32) -> i32,
>;
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationProcess(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
        samples: *const f32,
        n: i32,
    ) -> *const SherpaOnnxOfflineSpeakerDiarizationResult;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationProcessWithCallback(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
        samples: *const f32,
        n: i32,
        callback: SherpaOnnxOfflineSpeakerDiarizationProgressCallback,
        arg: *mut ::std::os::raw::c_void,
    ) -> *const SherpaOnnxOfflineSpeakerDiarizationResult;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationProcessWithCallbackNoArg(
        sd: *const SherpaOnnxOfflineSpeakerDiarization,
        samples: *const f32,
        n: i32,
        callback: SherpaOnnxOfflineSpeakerDiarizationProgressCallbackNoArg,
    ) -> *const SherpaOnnxOfflineSpeakerDiarizationResult;
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeakerDiarizationDestroyResult(
        r: *const SherpaOnnxOfflineSpeakerDiarizationResult,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig {
    pub model: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig>() - 8usize];
    ["Alignment of SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeechDenoiserModelConfig {
    pub gtcrn: SherpaOnnxOfflineSpeechDenoiserGtcrnModelConfig,
    pub num_threads: i32,
    pub debug: i32,
    pub provider: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineSpeechDenoiserModelConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineSpeechDenoiserModelConfig>() - 24usize];
    ["Alignment of SherpaOnnxOfflineSpeechDenoiserModelConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineSpeechDenoiserModelConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineSpeechDenoiserModelConfig::gtcrn"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeechDenoiserModelConfig, gtcrn) - 0usize];
    ["Offset of field: SherpaOnnxOfflineSpeechDenoiserModelConfig::num_threads"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeechDenoiserModelConfig, num_threads) - 8usize];
    ["Offset of field: SherpaOnnxOfflineSpeechDenoiserModelConfig::debug"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeechDenoiserModelConfig, debug) - 12usize];
    ["Offset of field: SherpaOnnxOfflineSpeechDenoiserModelConfig::provider"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeechDenoiserModelConfig, provider) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeechDenoiserConfig {
    pub model: SherpaOnnxOfflineSpeechDenoiserModelConfig,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxOfflineSpeechDenoiserConfig"]
        [::std::mem::size_of::<SherpaOnnxOfflineSpeechDenoiserConfig>() - 24usize];
    ["Alignment of SherpaOnnxOfflineSpeechDenoiserConfig"]
        [::std::mem::align_of::<SherpaOnnxOfflineSpeechDenoiserConfig>() - 8usize];
    ["Offset of field: SherpaOnnxOfflineSpeechDenoiserConfig::model"]
        [::std::mem::offset_of!(SherpaOnnxOfflineSpeechDenoiserConfig, model) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxOfflineSpeechDenoiser {
    _unused: [u8; 0],
}
unsafe extern "C" {
    pub fn SherpaOnnxCreateOfflineSpeechDenoiser(
        config: *const SherpaOnnxOfflineSpeechDenoiserConfig,
    ) -> *const SherpaOnnxOfflineSpeechDenoiser;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyOfflineSpeechDenoiser(sd: *const SherpaOnnxOfflineSpeechDenoiser);
}
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeechDenoiserGetSampleRate(
        sd: *const SherpaOnnxOfflineSpeechDenoiser,
    ) -> i32;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SherpaOnnxDenoisedAudio {
    pub samples: *const f32,
    pub n: i32,
    pub sample_rate: i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of SherpaOnnxDenoisedAudio"][::std::mem::size_of::<SherpaOnnxDenoisedAudio>() - 16usize];
    ["Alignment of SherpaOnnxDenoisedAudio"]
        [::std::mem::align_of::<SherpaOnnxDenoisedAudio>() - 8usize];
    ["Offset of field: SherpaOnnxDenoisedAudio::samples"]
        [::std::mem::offset_of!(SherpaOnnxDenoisedAudio, samples) - 0usize];
    ["Offset of field: SherpaOnnxDenoisedAudio::n"]
        [::std::mem::offset_of!(SherpaOnnxDenoisedAudio, n) - 8usize];
    ["Offset of field: SherpaOnnxDenoisedAudio::sample_rate"]
        [::std::mem::offset_of!(SherpaOnnxDenoisedAudio, sample_rate) - 12usize];
};
unsafe extern "C" {
    pub fn SherpaOnnxOfflineSpeechDenoiserRun(
        sd: *const SherpaOnnxOfflineSpeechDenoiser,
        samples: *const f32,
        n: i32,
        sample_rate: i32,
    ) -> *const SherpaOnnxDenoisedAudio;
}
unsafe extern "C" {
    pub fn SherpaOnnxDestroyDenoisedAudio(p: *const SherpaOnnxDenoisedAudio);
}
